app/views/pictures/index.html.erb


      <span class='likes_count'><%= picture.likes.count %></span> <%= 'like'.pluralize(picture.likes.count) %> </p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."picture_id" = $1  [["picture_id", 1]]