app/controllers/comments_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
  @picture = Picture.find(params[:picture_id])

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("thoughts", "created_at", "updated_at", "picture_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
def create
  @picture = Picture.find params[:picture_id]
  @comment = @picture.build_comment comment_params, current_user
  if @comment.save